NextFOAM-2401/tutorials/compressible/acousticFoam/obliqueAirJet/precursor/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Tinlet          293;

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $Tinlet;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $Tinlet;
    }

    "(window|fixedWall)"
    {
        type            zeroGradient;
    }

    box
    {
        type            inletOutlet;
        inletValue      uniform $Tinlet;
        value           uniform $Tinlet;
    }
}


// ************************************************************************* //
